Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_complaints/where_to_complain_about_home_improvements.html.txt.tmx
Source language: en
Languages: ga

source: Where to complain about home building or home improvements
ga: Cén áit le gearán a dhéanamh faoi thógáil agus feabhsuithe tí

source: Here you will find information on the various organisations that deal with trades and professions involved in home building or home improvements in Ireland
ga: Is anseo a bhfaighidh tú eolas ar na heagraíochtaí éagsúla a bhíonn ag plé le ceirdeanna agus gairmeacha atá bainteach i dtógáil tí nó i bhfeabhsuithe tí in Éirinn

source: Many professions are involved in home improvements and the major ones are listed here
ga: Tá go leor gairmeacha bainteach le feabhsuithe tí agus liostaítear na príomhchinn anseo

source: Many service suppliers are not members of any trade or professional body and you may not be able to complain to any of these organisations
ga: Ní baill d’aon chomhlacht ceirde nó gairme iad go leor soláthraithe seirbhíse agus seans nach mbeidh tú in ann gearán a dhéanamh le haon cheann de na heagraíochtaí seo

source: The best way to ensure that you get the service that you are looking for is to follow the advice given in our document Your rights when you buy a service. Consumer contracts are protected by the Sale of Goods and Supply of Services Act, 1980
ga: Is é an bealach is fearr le cinntiú go bhfaigheann tú an tseirbhís a raibh tú ar a lorg ná an chomhairle anseo a ghlacadh.Tá conarthaí tomhaltóirí cosanta ag an Acht um Dhíolachán Earraí agus Soláthar Seirbhísí 1980

source: If you have a contract with a service supplier you can expect that:
ga: Má tá conradh agat le soláthraí seirbhíse, d’fhéadfá a bheith ag súil leis an méid seo a leanas:

source: • The supplier has the necessary skill to provide the service
ga: • Go bhfuil na scileanna riachtanacha ag an soláthraí chun an tseirbhís a sholáthar

source: • The service will be provided with proper care and diligence
ga: • Go soláthrófar an tseirbhís le cúram cuí agus le díograis

source: • The materials used will be sound and that goods supplied with the service will be of merchantable quality
ga: • Go mbeidh na hábhair a úsáidfear ceart agus go mbeidh na hearraí a sholáthraítear leis an tseirbhís ar cháilíocht indíolta

source: In a service contract, at the very least, you should ensure that you know the price of the service and the time that it will take to complete the agreed work
ga: I gconradh seirbhíse, ba cheart duit a chinntiú , ar a laghad, go bhfuil a fhios agat praghas na seirbhíse agus an méid ama a thógfaidh sé chun an obair chomhaontaithe a chur i gcrích

source: General Craftsmen and Trades
ga: Ceardaithe Ginearálta agus Ceirdeanna

source: The National Guild of Master Craftsmen is a representative organisation for trades and professions
ga: Eagraíocht ionadaíoch do cheirdeanna agus do ghairmeacha é Cumann Náisiúnta na Máistircheardaithe

source: They run a complaints service and will act as an intermediary in a dispute between a consumer and a member of theirs
ga: Reáchtáileann siad seirbhís ghearáin agus imreoidh siad ról an idirghabhálaí i gcomhrac idir tomhaltóir agus ball dá gcuid

source: The Construction Industry Register Ireland (CIRI) is an official online register of builders, contractors, specialist sub-contractors and tradespersons who undertake to carry out construction works
ga: Is éard is HomeBond ann Scéim Náisiúnta Rathaíochta na Tógála Tí a bhunaigh Cumann an Tionscail Tógála agus Cumann Thógálaithe Baile na hÉireann, i gcomhpháirt leis an Roinn Tithíochta, Pleanála, Pobail agus Rialtais Áitiúil

source: You can make a formal complaint if a registered member has failed to adhere to CIRI's Code of Ethics. You can read more about making a complaint on the CIRI website
ga: Cinntíonn sé go gcothabháltar na caighdeáin tógála cuíthe agus cosnaíonn sé ceannaitheoirí trí frithgheallúint a dhéanamh ar aon lochtanna struchtúrtha móra

source: HomeBond, the National House Building Guarantee Scheme, is a scheme established by the Construction Industry Federation and the Irish Home Builders Association, in conjunction with the Department of the Housing, Planning, Community and Local Government
ga: Tá scéim ghearáin ag HomeBond le haghaidh lochtanna neamhstruchtúrtha i dtithe nua, ag teacht chun solais laistigh de bhliain tar éis duit an teach a cheannacht

source: It ensures that proper building standards are maintained and protects purchasers by underwriting any major structural defects in new homes
ga: I measc lochtanna neamhstruchtúrtha a chlúdaítear faoin scéim tá pluiméaracht phollta, urláir mhíchothroma, sáruithe ar riachtanais dóiteáin, cuir i gcás aláraim deataigh, agus easpa inslithe

source: Buyers should check that their particular builder or developer is Homebond registered
ga: Ba cheart do cheannaitheoirí seiceáil an bhfuil a dtógálaí nó forbróir áirithe cláraithe

source: Further information is available on the Homebond website
ga: Má thagann aon fhadhb i gceist, ba cheart don cheannaitheoir fógra a thabhairt don tógálaí i scríbhinn

source: Homebond can be contacted by email: info@homebond.ie or by telephone 1850 306 300
ga: Is féidir dul i dteagmháil le HomeBond tríd an ríomhphost: headoffice@homebond.ie nó ar an teileafón ag 1850 306 300

source: The Pyrite Resolution Board has set up a scheme for the remediation of significant damage to dwellings caused by pyritic heave
ga: Tá scéim á cur ar bun ag an mBord Réitigh Phiríte i dtaca le hath-idirghabháil damáiste shuntasaigh d’áitribh a bhfuil aistriú piríteach ina chúis leis

source: This damage can occur when there is pyrite in the hardcore material used
ga: Féadfaidh an damáiste seo tarlú nuair is í pirít an miotal crua a úsáidtear

source: You can get more information about the scheme and apply for it online at pyriteboard.ie
ga: Féadfaidh tú tuilleadh eolais a fháil agus iarratas a dhéanamh ar líne ar pyriteboard.ie

source: The Royal Institute of the Architects of Ireland aims to protect the public by insisting on high standards of professional conduct and admitting only properly examined members
ga: Tá sé mar aidhm ag Institiúid Ríoga Ailtirí na hÉireann an pobal a chosaint trí ardchaighdeáin d’iompar gairmiúil a éileamh agus iad ag ligean isteach ball nuair atá scrúdú ceart déanta orthu

source: The Institute of Professional Auctioneers and Valuers is the representative body for auctioneers
ga: Is é Institiúid Ceantálaithe agus Luachálaithe Gairmiúla na hÉireann an comhlacht iondaíochta do cheantálaithe

source: It is self-governing and operates a code of practice
ga: Tá sé féinrialaithe agus oibríonn sé cód cleachtais

source: It has a complaints procedure for members of the public and a compensation fund for cases of misappropriation of clients’ funds
ga: Tá nós imeachta gearáin acu don phobal agus ciste cúitimh le haghaidh cásanna mídhilsithe de mhaoinithe chliaint

source: You can also make complaints about auctioneers and estate agents to the Property Services Regulatory Authority
ga: Is féidir leat a dhéanamh freisin ar ghearáin faoi ceantálaithe agus gníomhairí eastáit leis an Údarás Seirbhísí Maoine Rialála

source: The Society of Chartered Surveyors Ireland (SCSI) is the professional body for Chartered Surveyors
ga: Is é Cumann na Suirbhéirí Cairte Éireann (SCSI) an comhlacht gairmiúil do Shuirbhéirí Cairte

source: Register of Electrical Contractors of Ireland (RECI) is a voluntary self-regulatory body for the electrical contracting industry
ga: Is comhlacht deonach féinrialaithe é Clár Conraitheoirí Leictreacha na hÉireann (RECI) do thionscal conraitheoirí leictreacha

source: It aims to promote and protect the interests of the public as users of electrical service so that they obtain an acceptable standard of workmanship and technical competence within the electrical contracting industry
ga: Tá sé mar aidhm aige leas an phobail a chur chun cinn agus a chosaint mar úsáideoirí de sheirbhísí leictreachais ionas gur féidir leo caighdeán inghlactha ceardaíochta agus cumas teicniúil a fháil ó thionscal na gconraitheoirí leictreacha

source: RECI investigates complaints about the standard of work of registered contractors
ga: Fiosraíonn an RECI gearáin maidir le caighdeán oibre na gconraitheoirí cláraithe

source: Electrical Contractors Safety and Standards Association Ltd. (ECSSA) is a voluntary self-regulatory body for the electrical contracting industry
ga: Is comhlacht deonach féinrialaithe é an Eagraíocht um Shábháilteacht agus Chaighdeáin Conraitheoirí Leictreacha Teoranta do thionscal conraitheoirí leictreacha

source: It aims to improve the standards of electrical installation work in Ireland by promoting and protecting the interests of the public relating to electrical services
ga: Tá sé mar aidhm aige caighdeáin obair inslithe leictreach a fheabhsú in Éirinn trí leas an phobail maidir le seirbhísí leictreacha a chur chun cinn agus a fhorbairt

source: A complaint about an ECSSA member will be investigated by an ECSSA Inspector
ga: Déanfar fiosrú ar ghearán faoi ball den ECSSA ag cigire den ECSSA

source: Institution of Engineers of Ireland is the regulatory organisation for professional engineering in Ireland
ga: Is é Institiúid Innealtóirí na hÉireann an eagraíocht rialaithe d’innealtóireacht ghairmiúil in Éirinn

source: One of its aims is to maintain standards of professional ethics and conduct
ga: Is í ceann de na haidhmeanna atá aige ná caighdeáin na heitice agus an iompair ghairmiúil a chothabháil

source: Currently there are no representative bodies for plumbers
ga: Níl aon chomhlacht iondaíochta ann do phluiméaraí faoi láthair

source: However, if you are installing or working on a gas heating system or cooker it is important for your safety that you get a competent gas installer
ga: Mar sin féin, má tá tú ag cur isteach nó ag obair ar chóras téimh gáis nó cócaire gáis tá sé tábhachtach ar son do shábháilteachta go bhfaigheann tú duine maith cumasach len é a chur isteach duit

source: Bord Gáis, as part of a safety assurance programme, maintains a list of competent gas installers
ga: Mar chuid de chlár dearbhaithe cáilíochta, cothabhálann Bord Gáis liosta de shuiteálaithe maithe gáis

source: Irish Standards exist (I.S
ga: Is ann do Chaighdeáin Éireannacha (I.S

source: 820) to protect you from sub standard work, which, in the case of gas equipment installation or repair, could be deadly
ga: 820) chun tú féin a chosaint ó obair faoi bhun an chaighdeáin, rud a d’fhéadfadh a bheith marfach i gcás shuiteáil nó deisiúchán trealaimh gáis

source: You can find a Registered Gas Installer in your area here
ga: Is féidir leat Suiteálaí Gáis Cláraithe i do cheantar a aimsiú anseo
